[
  {
    "Title": "Vastness - Prototype",
    "BriefDescription": "Briefly explore an underground laboratory.",
    "FullDescription": "An experiment in 3D modeling and in implementing+modifying 3rd party assets.",
    "Credits": "Lead Developer",
    "Link": "https://gamejolt.com/games/VastnessPrototype/753214"
  },
  {
    "Title": "Two Tails Tale, by Unsung Productions",
    "BriefDescription": "The story of two rats and their quest to rebuild a church.",
    "FullDescription": "(Front the page) In an abandoned Villa, the two small adventurers, Minx and Lowell, aid their village with a small errand. This small demo follows our couple in their search to find materials to build a new church. This is a proof of concept and only partially represents what the final game will be like. Please send any suggestion and/or critiques our way on our Discord server here: https://discord.gg/Yt6sgs7",
    "Credits": "Assistant Programmer",
    "Link": "https://unsungproductions.itch.io/two-tails-tale-alpha"
  },
  {
    "Title": "Eternity's Tower (Demo)",
    "BriefDescription": "Ascend an enormous tower in your bid for freedom.",
    "FullDescription": "Developed as a passion-project in 2022, Eternity's Tower covers the advengures of the Stranger and his quest to leave this corrupt planet. Over the course of several stages, the Stranger faces increasingly difficult obstacles and worsening heights - all while being chased by the loathsome Wraith.",
    "Link": "",
    "Credits": "Lead Developer"
  },
  {
    "Title": "God Rend V0.1",
    "BriefDescription": "A brief console application in which you command a team of cybernetic warriors against a rival team for victory.",
    "FullDescription": "Done as a proof-of-concept, this project focuses on team-based combat between two parties of fully-developed warriors. Each warrior has a custom set of abilities and differing stats, invoking the player to play their cards carefully.",
    "Link": "https://github.com/AllHailTheTurnip/GodRend_v0.1a",
    "Credits": "Lead Developer"
  },
  {
    "Title": "Vertigo",
    "BriefDescription": "An experimental game about braving perilous heights all while balancing on narrow platforms. Sounds easy - until everything starts spinning.",
    "FullDescription": "Originally launched under the experimental mechanic of a rotating camera, the game messes with your sense of direction, tempting you to hit the wrong button and fling yourself off the edge. The game took an overall four weeks of intermittent development to produce.",
    "Link": "https://gamejolt.com/games/Vertigo/365903",
    "Credits": "Lead Developer"
  }
]
